PX4/PX4-Autopilot/nuttx/arch/arm/src/lpc43xx/chip/lpc43_can.h
#define CAN_EC_TEC_SHIFT             (0)       /* Bits 0-7: Transmit error counter */
#define CAN_EC_TEC_MASK              (0xff << CAN_EC_TEC_SHIFT)
#define CAN_EC_REC_SHIFT             (8)       /* Bits 8-14: Receive error counter */
#define CAN_EC_REC_MASK              (0x7f << CAN_EC_REC_SHIFT)
#define CAN_EC_RP                    (1 << 15)  /* Bit 15:  Receive error passive */
                                                /* Bits 16-31: Reserved */
/* Bit timing register */

#define CAN_BT_BRP_SHIFT             (0)        /* Bits 0-5: Baud rate prescaler */
#define CAN_BT_BRP_MASK              (0x3f << CAN_BT_BRP_SHIFT)
#define CAN_BT_SJW_SHIFT             (6)        /* Bits 6-7: (Re)synchronization jump width */
#define CAN_BT_SJW_MASK              (3 << CAN_BT_SJW_SHIFT)
#define CAN_BT_TSEG1_SHIFT           (8)        /* Bits 8-11: Time segment after the sample point */
#define CAN_BT_TSEG1_MASK            (15 << CAN_BT_TSEG1_SHIFT)
#define CAN_BT_TSEG2_SHIFT           (12)       /* Bits 12-14: Time segment before the sample point */
#define CAN_BT_TSEG2_MASK            (7 << CAN_BT_TSEG2_SHIFT)
                                                /* Bits 15-31: Reserved */
/* Interrupt register */

#define CAN_INT_SHIFT                (0)       /* Bits 0-15: Interrupt ID */
#define CAN_INT_MASK                 (0xffff << CAN_INT_SHIFT)
#  define CAN_INT_NONE               (0 << CAN_INT_SHIFT)  /* No interrupt pending */
#  define CAN_INT_MSG1               (1 << CAN_INT_SHIFT)  /* Message 1 */
#  define CAN_INT_MSG2               (2 << CAN_INT_SHIFT)  /* Message 2 */
#  define CAN_INT_MSG3               (3 << CAN_INT_SHIFT)  /* Message 3 */
#  define CAN_INT_MSG4               (4 << CAN_INT_SHIFT)  /* Message 4 */
#  define CAN_INT_MSG5               (5 << CAN_INT_SHIFT)  /* Message 5 */
#  define CAN_INT_MSG6               (6 << CAN_INT_SHIFT)  /* Message 6 */
#  define CAN_INT_MSG7               (7 << CAN_INT_SHIFT)  /* Message 7 */
#  define CAN_INT_MSG8               (8 << CAN_INT_SHIFT)  /* Message 8 */
#  define CAN_INT_MSG9               (9 << CAN_INT_SHIFT)  /* Message 9 */
#  define CAN_INT_MSG10              (10 << CAN_INT_SHIFT) /* Message 10 */
#  define CAN_INT_MSG11              (11 << CAN_INT_SHIFT) /* Message 11 */
#  define CAN_INT_MSG12              (12 << CAN_INT_SHIFT) /* Message 12 */
#  define CAN_INT_MSG13              (13 << CAN_INT_SHIFT) /* Message 13 */
#  define CAN_INT_MSG14              (14 << CAN_INT_SHIFT) /* Message 14 */
#  define CAN_INT_MSG15              (15 << CAN_INT_SHIFT) /* Message 15 */
#  define CAN_INT_MSG16              (16 << CAN_INT_SHIFT) /* Message 16 */
#  define CAN_INT_MSG17              (17 << CAN_INT_SHIFT) /* Message 17 */
#  define CAN_INT_MSG18              (18 << CAN_INT_SHIFT) /* Message 18 */
#  define CAN_INT_MSG19              (19 << CAN_INT_SHIFT) /* Message 19 */
#  define CAN_INT_MSG20              (20 << CAN_INT_SHIFT) /* Message 20 */
#  define CAN_INT_MSG21              (21 << CAN_INT_SHIFT) /* Message 21 */
#  define CAN_INT_MSG22              (22 << CAN_INT_SHIFT) /* Message 22 */
#  define CAN_INT_MSG23              (23 << CAN_INT_SHIFT) /* Message 23 */
#  define CAN_INT_MSG24              (24 << CAN_INT_SHIFT) /* Message 24 */
#  define CAN_INT_MSG25              (25 << CAN_INT_SHIFT) /* Message 25 */
#  define CAN_INT_MSG26              (26 << CAN_INT_SHIFT) /* Message 26 */
#  define CAN_INT_MSG27              (27 << CAN_INT_SHIFT) /* Message 27 */
#  define CAN_INT_MSG28              (28 << CAN_INT_SHIFT) /* Message 28 */
#  define CAN_INT_MSG29              (29 << CAN_INT_SHIFT) /* Message 29 */
#  define CAN_INT_MSG30              (30 << CAN_INT_SHIFT) /* Message 30 */
#  define CAN_INT_MSG31              (31 << CAN_INT_SHIFT) /* Message 31 */
#  define CAN_INT_MSG32              (32 << CAN_INT_SHIFT) /* Message 32 */
#  define CAN_INT_MSG32              (0x8000 << CAN_INT_SHIFT) /* Status interrupt */
                                               /* Bits 16-31: Reserved */
/* Test register */
                                               /* Bits 0-1: Reserved */
#define CAN_TEST_BASIC               (1 << 2)  /* Bit 2:  Basic mode */
#define CAN_TEST_SILENT              (1 << 3)  /* Bit 3:  Silent mode */
#define CAN_TEST_LBACK               (1 << 4)  /* Bit 4:  Loop back mode */
#define CAN_TEST_TX_SHIFT            (5)       /* Bits 5-6: Control of TD pins */
#define CAN_TEST_TX_MASK             (3 << CAN_TEST_TX_SHIFT)
#  define CAN_TEST_TX_CAN            (0 << CAN_TEST_TX_SHIFT) /* Level controlled CAN controller */
#  define CAN_TEST_TX_MONITOR        (1 << CAN_TEST_TX_SHIFT) /* Sample point monitored TD pin */
#  define CAN_TEST_TX_DOMINANT       (2 << CAN_TEST_TX_SHIFT) /* TD pin LOW/dominant */
#  define CAN_TEST_TX_RECESSIVE      (3 << CAN_TEST_TX_SHIFT) /* TD pin HIGH/recessive */
#define CAN_TEST_RX                  (1 << 7)  /* Bit 7:  Monitors actual value of RD Pin */
                                               /* Bits 8-31: Reserved */
/* Baud rate prescaler extension register */

#define CAN_BRPE_SHIFT               (0)       /* Bits 0-3: Baud rate prescaler extension */
#define CAN_BRPE_MASK                (15 << CAN_BRPE_SHIFT)
                                               /* Bits 4-31: Reserved */
/* Message interface 1/2 command request */

#define CAN_CMDREQ_MSGNO_SHIFT       (0)       /* Bits 0-5: Message number */
#define CAN_CMDREQ_MSGNO_MASK        (0x3f << CAN_CMDREQ_MSGNO_SHIFT)
                                               /* Bits 6-14: Reserved */
#define CAN_CMDREQ_BUSY              (1 << 15) /* Bit 15: BUSY flag */
                                               /* Bits 16-31: Reserved */
/* Message interface 1/2 command mask (write) */

#define CAN_CMDMSKW_DATAB            (1 << 0)  /* Bit 0:  Access data bytes 4-7 */
#define CAN_CMDMSKW_DATAA            (1 << 1)  /* Bit 1:  Access data bytes 0-3 */
#define CAN_CMDMSKW_TXRQST           (1 << 2)  /* Bit 2:  Access transmission request bit */
#define CAN_CMDMSKW_CLRINTPND        (1 << 3)  /* Bit 3:  Ignored in the write direction */
#define CAN_CMDMSKW_CTRL             (1 << 4)  /* Bit 4:  Access control bits */
#define CAN_CMDMSKW_ARB              (1 << 5)  /* Bit 5:  Access arbitration bits */
#define CAN_CMDMSKW_MASK             (1 << 6)  /* Bit 6:  Access mask bits */
#define CAN_CMDMSKW_WRRD             (1 << 7)  /* Bit 7:  Write transfer (1) */
                                               /* Bits 8-31: Reserved */
/* Message interface 1/2 command mask (read) */

#define CAN_CMDMSKR_DATAB            (1 << 0)  /* Bit 0:  Access data bytes 4-7 */
#define CAN_CMDMSKR_DATAA            (1 << 1)  /* Bit 1:  Access data bytes 0-3 */
#define CAN_CMDMSKR_NEWDAT           (1 << 2)  /* Bit 2:  Access new data bit */
#define CAN_CMDMSKR_CLRINTPND        (1 << 3)  /* Bit 3:  Clear interrupt pending bit */
#define CAN_CMDMSKR_CTRL             (1 << 4)  /* Bit 4:  Access control bits */
#define CAN_CMDMSKR_ARB              (1 << 5)  /* Bit 5:  Access arbitration bits */
#define CAN_CMDMSKR_MASK             (1 << 6)  /* Bit 6:  Access mask bits */
#define CAN_CMDMSKR_WRRD             (1 << 7)  /* Bit 7:  Read transfer (0) */
                                               /* Bits 8-31: Reserved */
/* Message interface 1/2 mask 1 */

