PX4/PX4-Autopilot/nuttx/arch/arm/src/lpc43xx/chip/lpc43_can.h
#define CAN_MSK1                     0xffff    /* Bits 0-15: Identifier mask 0-15 */
                                               /* Bits 16-31: Reserved */
/* Message interface 1/2 mask 2 */

#define CAN_MSK2                     0x1fff    /* Bits 0-12: Identifier mask 16-28 */
                                               /* Bit 13: Reserved */
#define CAN_MSK2_MDIR                (1 << 14) /* Bit 14: Mask message direction */
#define CAN_MSK2_MXTD                (1 << 15) /* Bit 15: Mask extend identifier */
                                               /* Bits 16-31: Reserved */
/* Message interface 1/2 arbitration */

#define CAN_ARB1                     0xffff    /* Bits 0-15: Identifier mask 0-15 */
                                               /* Bits 16-31: Reserved */
/* Message interface 1/2 arbitration */

#define CAN_MSK2                     0x1fff    /* Bits 0-12: Identifier mask 16-28 */
#define CAN_MSK2_DIR                 (1 << 13) /* Bit 13: Message direction */
#define CAN_MSK2_XTD                 (1 << 14) /* Bit 14: Extend identifier */
#define CAN_MSK2_MSGVAL              (1 << 15) /* Bit 15: Message valid */
                                               /* Bits 16-31: Reserved */
/* Message interface 1 message control */

#define CAN_MCTRL_DLC_SHIFT          (0)       /* Bits 0-3: Data length code */
#define CAN_MCTRL_DLC_MASK           (15 << CAN_MCTRL_DLC_SHIFT)
                                               /* Bits 4-6: Reserved */
#define CAN_MCTRL_EOB                (1 << 7)  /* Bit 7:  End of buffer */
#define CAN_MCTRL_TXRQST             (1 << 8)  /* Bit 8:  Transmit request */
#define CAN_MCTRL_RMTEN              (1 << 9)  /* Bit 9:  Remote enable */
#define CAN_MCTRL_RXIE               (1 << 10) /* Bit 10: Receive interrupt enable */
#define CAN_MCTRL_TXIE               (1 << 11) /* Bit 11: Transmit interrupt enable */
#define CAN_MCTRL_UMASK              (1 << 12) /* Bit 12: Use acceptance mask */
#define CAN_MCTRL_INTPND             (1 << 13) /* Bit 13: Interrupt pending */
#define CAN_MCTRL_MSGLST             (1 << 14) /* Bit 14: Message lost */
#define CAN_MCTRL_NEWDAT             (1 << 15) /* Bit 15: New data */
                                               /* Bits 16-31: Reserved */
/* Message interface 1/2 data A1 */

#define CAN_DA1_DATA0_SHIFT          (0)       /* Bits 0-7: Data byte 0 */
#define CAN_DA1_DATA0_MASK           (0xff << CAN_DA1_DATA0_SHIFT)
#define CAN_DA1_DATA1_SHIFT          (8)       /* Bits 8-15: Data byte 1 */
#define CAN_DA1_DATA1_MASK           (0xff << CAN_DA1_DATA1_SHIFT)
                                               /* Bits 16-31: Reserved */
/* Message interface 1/2 data A2 */

#define CAN_DA2_DATA2_SHIFT          (0)       /* Bits 0-7: Data byte 2 */
#define CAN_DA2_DATA2_MASK           (0xff << CAN_DA2_DATA2_SHIFT)
#define CAN_DA2_DATA3_SHIFT          (8)       /* Bits 8-15: Data byte 3 */
#define CAN_DA2_DATA3_MASK           (0xff << CAN_DA2_DATA3_SHIFT)
                                               /* Bits 16-31: Reserved */
/* Message interface 1/2 data B1 */

#define CAN_DB1_DATA4_SHIFT          (0)       /* Bits 0-7: Data byte 4 */
#define CAN_DB1_DATA4_MASK           (0xff << CAN_DB1_DATA4_SHIFT)
#define CAN_DB1_DATA5_SHIFT          (8)       /* Bits 8-15: Data byte 5 */
#define CAN_DB1_DATA5_MASK           (0xff << CAN_DB1_DATA5_SHIFT)
                                               /* Bits 16-31: Reserved */
/* Message interface 1/2 data B2 */

#define CAN_DB2_DATA6_SHIFT          (0)       /* Bits 0-7: Data byte 6 */
#define CAN_DB2_DATA6_MASK           (0xff << CAN_DB2_DATA6_SHIFT)
#define CAN_DB2_DATA7_SHIFT          (8)       /* Bits 8-15: Data byte 7 */
#define CAN_DB2_DATA7_MASK           (0xff << CAN_DB2_DATA6_SHIFT)
                                               /* Bits 16-31: Reserved */
/* Transmission request 1 */

#define CAN_TXREQ1_MASK              0xffff    /* Bits 0-15: TX request bit msg 1-16 */
#define CAN_TXREQ1(n)                (1 << ((n)-1)
                                               /* Bits 16-31: Reserved */
/* Transmission request 2 */

#define CAN_TXREQ2_MASK              0xffff    /* Bits 0-15: TX request bit msg 17-32 */
#define CAN_TXREQ2(n)                (1 << ((n)-17)
                                               /* Bits 16-31: Reserved */
/* New data 1 */

#define CAN_ND1_MASK                 0xffff    /* Bits 0-15: New data bits msg 1-16 */
#define CAN_ND1(n)                   (1 << ((n)-1)
                                               /* Bits 16-31: Reserved */
/* New data 2 */

#define CAN_ND2_MASK                 0xffff    /* Bits 0-15: New data bits msg 17-32 */
#define CAN_ND2(n)                   (1 << ((n)-17)
                                               /* Bits 16-31: Reserved */
/* Interrupt pending 1 */

#define CAN_IR1_MASK                 0xffff    /* Bits 0-15: Interrup pending msg 1-16 */
#define CAN_IR1(n)                   (1 << ((n)-1)
                                               /* Bits 16-31: Reserved */
/* Interrupt pending 2 */

#define CAN_IR2_MASK                 0xffff    /* Bits 0-15: Interrup pending msg 17-32 */
#define CAN_IR2(n)                   (1 << ((n)-17)
                                               /* Bits 16-31: Reserved */
/* Message valid 1 */

#define CAN_MSGV1_MASK               0xffff    /* Bits 0-15: Interrup pending msg 1-16 */
#define CAN_MSGV1(n)                 (1 << ((n)-1)
                                               /* Bits 16-31: Reserved */
/* Message valid 2 */

#define CAN_MSGV2_MASK               0xffff    /* Bits 0-15: Interrup pending msg 17-32 */
#define CAN_MSGV2(n)                 (1 << ((n)-17)
                                               /* Bits 16-31: Reserved */
/* CAN clock divider register */

#define CAN_CLKDIV_SHIFT            (0)       /* Bits 0-3: Clock divider value */
#define CAN_CLKDIV_MASK             (15 << CAN_CLKDIV_SHIFT)
#  define CAN_CLKDIV_DIV1           (0 << CAN_CLKDIV_SHIFT) /* CAN_CLK = PCLK / 1 */
#  define CAN_CLKDIV_DIV2           (1 << CAN_CLKDIV_SHIFT) /* CAN_CLK = PCLK / 2 */
#  define CAN_CLKDIV_DIV3           (2 << CAN_CLKDIV_SHIFT) /* CAN_CLK = PCLK / 3 */
#  define CAN_CLKDIV_DIV5           (3 << CAN_CLKDIV_SHIFT) /* CAN_CLK = PCLK / 5 */
#  define CAN_CLKDIV_DIV9           (4 << CAN_CLKDIV_SHIFT) /* CAN_CLK = PCLK / 9 */
#  define CAN_CLKDIV_DIV 17         (5 << CAN_CLKDIV_SHIFT) /* CAN_CLK = PCLK / 17 */
#  define CAN_CLKDIV_DIV33          (6 << CAN_CLKDIV_SHIFT) /* CAN_CLK = PCLK / 33 */
#  define CAN_CLKDIV_DIV65          (7 << CAN_CLKDIV_SHIFT) /* CAN_CLK = PCLK / 65 */
#  define CAN_CLKDIV_DIV129         (8 << CAN_CLKDIV_SHIFT) /* CAN_CLK = PCLK / 129 */
#  define CAN_CLKDIV_DIV257         (9 << CAN_CLKDIV_SHIFT) /* CAN_CLK = PCLK / 257 */
#  define CAN_CLKDIV_DIV513         (10 << CAN_CLKDIV_SHIFT) /* CAN_CLK = PCLK / 513 */
#  define CAN_CLKDIV_DIV1025        (11 << CAN_CLKDIV_SHIFT) /* CAN_CLK = PCLK / 1025 */
#  define CAN_CLKDIV_DIV2049        (12 << CAN_CLKDIV_SHIFT) /* CAN_CLK = PCLK / 2049 */
#  define CAN_CLKDIV_DIV4097        (13 << CAN_CLKDIV_SHIFT) /* CAN_CLK = PCLK / 4097 */
#  define CAN_CLKDIV_DIV8093        (14 << CAN_CLKDIV_SHIFT) /* CAN_CLK = PCLK / 8093 */
#  define CAN_CLKDIV_DIV16385       (15 << CAN_CLKDIV_SHIFT) /* CAN_CLK = PCLK / 16385 */
                                               /* Bits 4-31: Reserved */

/************************************************************************************
 * Public Types
 ************************************************************************************/

/************************************************************************************
 * Public Data
 ************************************************************************************/

/************************************************************************************
 * Public Functions
 ************************************************************************************/

#endif /* __ARCH_ARM_SRC_LPC43XX_CHIP_LPC43_CAN_H */
